src/DataProcessors/ЛюдиВРозыске.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ЛюдиВРозыске</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Погоняло</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПолов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоМордыЛица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПоследнегоОбнаружения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/Enums/ВидыПолов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ВидыПолов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Муж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Жен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХЗ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ЛюдиВРозыске/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПоказатьСледующегоВРозыске();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СледующийВРозыске(Команда)
	
	Найден = Ложь;
	ПоказатьСледующегоВРозыске(Найден);
	
	Если Найден Тогда
		ПоказатьПредупреждение(, "ru = 'Истина ложна. Я лгун.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция Пол(ПолСтрокой)

	Значения = Новый Соответствие;
	Значения.Вставить("male", Перечисления.ВидыПолов.Муж);
	Значения.Вставить("female", Перечисления.ВидыПолов.Жен);
	
	Пол = Значения.Получить(ПолСтрокой);
	
	Если Пол = Неопределено Тогда
		Пол = Перечисления.ВидыПолов.ХЗ;
	КонецЕсли;
	
	Возврат Пол;

КонецФункции

&НаСервере
Процедура ПоказатьСледующегоВРозыске(Найден = Ложь)
	
	Ответ = КоннекторHTTP.GetJson(URL());
	
	Результаты = Ответ.Получить("results");
	
	Если ТипЗнч(Результаты) = Тип("Массив") Тогда
	
		Для каждого Результат Из Результаты Цикл
			
			Если НЕ ТипЗнч(Результат) = Тип("Соответствие") Тогда
				Продолжить;
			КонецЕсли;

			Объект.Погоняло = СвойствоСоответствияРекурсивно(Результат, "name.last");
			Объект.АдресПоследнегоОбнаружения = СвойствоСоответствияРекурсивно(Результат, "location.state");
			Объект.ФотоМордыЛица = СвойствоСоответствияРекурсивно(Результат, "picture.large");
			Объект.Идентификатор = СвойствоСоответствияРекурсивно(Результат, "login.uuid");

			ДатаРожденияСтрокой = СвойствоСоответствияРекурсивно(Результат, "dob.date");
			Объект.ДатаРождения = ПрочитатьДатуJSON(ДатаРожденияСтрокой, ФорматДатыJSON.ISO);

			Объект.Возраст = СвойствоСоответствияРекурсивно(Результат, "dob.age");
			
			ПолСтрокой = СвойствоСоответствияРекурсивно(Результат, "gender");
			Объект.Пол = Пол(ПолСтрокой);
			
			Найден = ЭтоИскомыйПерсонаж();

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЭтоИскомыйПерсонаж()

	Возврат Объект.Погоняло = "М." И Объект.АдресПоследнегоОбнаружения = "Воронеж" И Объект.Возраст > 18;

КонецФункции

// Возвращает значение свойства структуры.
//
// Параметры:
//   Структура - Структура, ФиксированнаяСтруктура - Объект, из которого необходимо прочитать значение ключа.
//   КлючиСтрокой - Строка - Имена свойств структур через точку.
//   ЗначениеПоУмолчанию - Произвольный - Необязательный. Возвращается когда в структуре нет значения по указанному
//                                        ключу.
//       Для скорости рекомендуется передавать только быстро вычисляемые значения (например примитивные типы),
//       а инициализацию более тяжелых значений выполнять после проверки полученного значения (только если это
//       требуется).
//
// Возвращаемое значение:
//   Произвольный - Значение свойства структуры. ЗначениеПоУмолчанию если в структуре нет указанного свойства.
//
&НаСервереБезКонтекста
Функция СвойствоСоответствияРекурсивно(Соответствие, Знач КлючиСтрокой, ЗначениеПоУмолчанию = Неопределено)
	
	Если Не ТипЗнч(Соответствие) = Тип("Соответствие") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Разделитель = ".";
	
	Ключи = СтрРазделить(КлючиСтрокой, Разделитель);
	
	Если Ключи.Количество() = 0 Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли; 
	
	Ключ = Ключи[0];
	
	Значение = СвойствоСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию);
	
	Если Ключи.Количество() > 1 Тогда
		// Последний уровень
		Ключи.Удалить(0);
		КлючиСтрокой = СтрСоединить(Ключи, Разделитель);
		
		Если ТипЗнч(Значение) = Тип("Соответствие") Тогда
			
			Значение = СвойствоСоответствияРекурсивно(Значение, КлючиСтрокой, ЗначениеПоУмолчанию);
			
		Иначе	
			
			Значение = ЗначениеПоУмолчанию;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	Возврат Значение;
	
КонецФункции

&НаСервереБезКонтекста
Функция СвойствоСоответствия(Соответствие, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Если Соответствие = Неопределено Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Результат = Соответствие.Получить(Ключ);
	Если Результат = Неопределено Тогда
		Результат = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция URL()
	Возврат "https://randomuser.me/api/";
КонецФункции;

#КонецОбласти
